source/_static/diagrams/recipe-write.d2
direction: right
n0: "sources"
n1: "sanity"
n2: "file"
n0 -> n1
n1 -> n2
